DataFrame

* 2차원 형태의 자료형이다.
* 인덱스, 컬럼, value값으로 이루어져 있다.

In [3]:
import pandas as pd
import numpy as np

# 선언

## from List

- by List : 리스트1 + 리스트2 +... + 컬럼 이름 = 데이타 프레임

In [21]:
a = [1, 3, 4, 5, 6]
b = [3, 2, 1, 1, 1]
pd.DataFrame([a,b])

   0  1  2  3  4
0  1  3  4  5  6
1  3  2  1  1  1

In [22]:
pd.DataFrame({'a':a, 'b':b})

   a  b
0  1  3
1  3  2
2  4  1
3  5  1
4  6  1

In [23]:
list_data = [[1,2,3],[4,5,6], [7,8,9],[10,11,12],[13,14,15]]
pd.DataFrame(list_data)

    0   1   2
0   1   2   3
1   4   5   6
2   7   8   9
3  10  11  12
4  13  14  15

## from dict

In [20]:
pd.DataFrame([{'A':2, 'B':4, 'D':3},{'A':4, 'B':5, 'C':7}])

   A  B    D    C
0  2  4  3.0  NaN
1  4  5  NaN  7.0

In [24]:
dict_data = {'c0':[1,2,3],'c1':[4,5,6],'c2' : [7,8,9],'c3' : [10,11,12], 'c4':[13,14,15]}
pd.DataFrame(dict_data)

   c0  c1  c2  c3  c4
0   1   4   7  10  13
1   2   5   8  11  14
2   3   6   9  12  15

## Series 와 비교를 해보자면

In [5]:
male_tuple = {'서울특별시': 4732275,
              '부산광역시': 1668618,
              '인천광역시': 1476813,
              '대구광역시': 1198815,
              '대전광역시': 734441,
              '광주광역시': 720060}
female_tuple = {'서울특별시': 4988571,
                '부산광역시': 1735805,
                '인천광역시': 1470404,
                '대구광역시': 1229139,
                '대전광역시': 736599,
                '광주광역시': 734988}

In [12]:
pd.Series(male_tuple)

서울특별시    4732275
부산광역시    1668618
인천광역시    1476813
대구광역시    1198815
대전광역시     734441
광주광역시     720060
dtype: int64

In [9]:
pd.Series(male_tuple).index

Index(['서울특별시', '부산광역시', '인천광역시', '대구광역시', '대전광역시', '광주광역시'], dtype='object')

In [13]:
pd.Series([male_tuple,female_tuple])

0    {'서울특별시': 4732275, '부산광역시': 1668618, '인천광역시': ...
1    {'서울특별시': 4988571, '부산광역시': 1735805, '인천광역시': ...
dtype: object

In [10]:
pd.Series([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

In [14]:
pd.DataFrame([male_tuple,female_tuple])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

In [11]:
pd.DataFrame([male_tuple,female_tuple]).index

RangeIndex(start=0, stop=2, step=1)

## from Series

- by Series :시리즈1 + 시리즈2 + 시리즈3 + 시리즈4 = 데이타프레임

In [16]:
male = pd.Series(male_tuple)
female = pd.Series(female_tuple)

아래와 같이 되는 이유는 각각의 value 값에 대응한 시리즈의 index가 컬럼으로 바뀌기 때문이다.

In [17]:
pd.DataFrame([male, female])

     서울특별시    부산광역시    인천광역시    대구광역시   대전광역시   광주광역시
0  4732275  1668618  1476813  1198815  734441  720060
1  4988571  1735805  1470404  1229139  736599  734988

간단하게 전치를 해서 컬럼과 인덱스를 바꿀수도 있지만,

In [18]:
pd.DataFrame([male, female]).T

             0        1
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

### 아래와 같이 컬럼값을 지정해서 Series의 index를 DataFrame의 키값으로 변형할 수 있다. 

**DataFrame 생성시에 column을 적어주느냐와 안적어주느냐는 큰 차이가 있다.**

In [19]:
pd.DataFrame({'남자인구수': male, '여자인구수':female})

         남자인구수    여자인구수
서울특별시  4732275  4988571
부산광역시  1668618  1735805
인천광역시  1476813  1470404
대구광역시  1198815  1229139
대전광역시   734441   736599
광주광역시   720060   734988

## from other sauce

* pd.read_csv 등등 수많은 sauce( html, json, 등등)

## from other DataFrame

- by other dataframe's columns : 컬럼1 + 컬럼2  +...= 데이타 프레임 
- by other dataframe's columns : dfA 컬럼 1 + dfB 컬럼 2   +...= 데이타 프레임

In [26]:
df1 = pd.DataFrame(np.random.randn(5,3), index=pd.date_range('01/02/2014',periods=5,freq='D'), columns=['a','b','c'] )
df2 = pd.DataFrame(np.random.randn(8,3), index=pd.date_range('01/01/2014',periods=8,freq='D'), columns=['a','b','c'] )

In [27]:
pd.DataFrame([df1['a'],df2['b']])

,2014-01-01,2014-01-02,2014-01-03,2014-01-04,2014-01-05,2014-01-06,2014-01-07,2014-01-08
a,NaN,-0.499913,-1.581105,0.845922,0.506632,1.486815,NaN,NaN
b,0.665024,0.126426,-1.345847,-1.801105,0.113579,0.652828,-0.257731,-0.498103

In [28]:
pd.DataFrame(df1[['a','b']])

                   a         b
2014-01-02 -0.499913 -1.012483
2014-01-03 -1.581105  1.423793
2014-01-04  0.845922  0.056107
2014-01-05  0.506632  0.626539
2014-01-06  1.486815  0.949737

In [29]:
pd.DataFrame({'a':df1['a'], 'b':df1['b']})

                   a         b
2014-01-02 -0.499913 -1.012483
2014-01-03 -1.581105  1.423793
2014-01-04  0.845922  0.056107
2014-01-05  0.506632  0.626539
2014-01-06  1.486815  0.949737